Tekla Open API Reference for Tekla Structures 2025
CannotCreateSectionViewFrom3dView Class
 The CannotCreateSectionViewFrom3dView class defines the exception that is thrown when a user tries to create a section view from a 3d view.
Inheritance Hierarchy
System.Object
 System.Exception
 System.ApplicationException
 Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException
 Tekla.Structures.Drawing.CannotCreateSectionViewFrom3dView
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class CannotCreateSectionViewFrom3dView : TeklaStructuresDrawingsApplicationException
<SerializableAttribute>
Public Class CannotCreateSectionViewFrom3dView
	Inherits TeklaStructuresDrawingsApplicationException
The CannotCreateSectionViewFrom3dView type exposes the following members.
Constructors
Name | Description
CannotCreateSectionViewFrom3dView
 Creates a new cannot create section view from 3d view exception instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace